Autodesk.Revit.DB.Analysis.AnalysisMode.BuildingElements
Energy Analysis Model based on building elements.
This value is deprecated in Revit 2027 and may be removed in a later version of Revit. Use the 'ConceptualMassesAndBuildingElements' option instead.